{
  "about_title": "ABOUT",
  "about_1": "I am a developer passionate about building AI-based services that connect people and technology.",
  "about_2": "I began my studies in nursing, but hands-on experience with medical technology made me realize the power of tech in helping people. This inspired me to change direction and pursue programming and AI.",
  "about_3": "I led the development of JudeBalance, a mobile app that analyzes balance data and recommends personalized exercises. I built the AI feedback system using OpenAI and ML, and developed the app with React Native, FastAPI, and Spring Boot.",
  "about_4": "Serving as a combat medic and working as a swimming teacher taught me that teamwork, empathy, and staying calm under pressure matter just as much as technical skill. I value building solutions through collaboration and clear communication.",
  "about_5": "In my free time, I enjoy playing football and going for runs.",

  "experience_title": "EXPERIENCE",
  "exp_swim_title": "Swimming Instructor",
  "exp_swim_period": "Chungju Swimming center · Jun–Sep 2022, Jun–Sep 2023",
  "exp_swim_1": "Taught swimming and managed safety for elementary students",
  "exp_swim_2": "Planned customized lessons and communicated with parents",
  "exp_swim_3": "Provided survival swimming lessons to schools in Chungju",
  "exp_eng_title": "Part-Time English Instructor",
  "exp_eng_period": "Yoon's English School IGSE · Sep–Nov 2023",
  "exp_eng_1": "Conducted English conversation and grammar classes for children",
  "exp_eng_2": "Managed attendance and parent notifications",
  "exp_eng_3": "Adjusted teaching based on feedback from students and parents",
  "exp_resume_link": "View Full Resume",

  "projects_title": "PROJECTS",
  "projects_type": "Team Project",
  "projects_name": "JudeBalance",
  "projects_desc1": "JudeBalance is an AI-powered healthcare app designed to assess and improve balance in middle-aged and older adults. Users hold a smartphone to their ear and stand on one foot for 20 seconds, during which 3-axis accelerometer and gyroscope data are collected at 20Hz intervals.",

  "projects_desc2": "From the collected sensor data, features such as sway magnitude, variability, and stability are extracted to calculate a balance score. A LightGBM-based classification model then analyzes this score along with user demographics to recommend the most suitable exercise from 15 predefined options.",

  "projects_desc3": "The app integrates the OpenAI API to generate natural language feedback and explanations for each recommendation, providing users with intuitive and motivating guidance.",

  "projects_desc4": "The AI inference server is built with FastAPI, while user management and data storage are handled by a Spring Boot backend. The entire backend system is deployed on Render, and communication between the client and servers is implemented via a RESTful API for scalability and reliability."
}
